In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('train.csv')
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.groupby('Parch')['Fare'].describe()

,count,mean,std,min,25%,50%,75%,max
Parch,,,,,,,,
0,678.0,25.586774,41.878786,0.0000,7.85420,10.50000,26.0000,512.3292
1,118.0,46.778180,63.709430,7.2292,17.21250,26.00000,39.6875,512.3292
2,80.0,64.337604,65.993088,7.7500,26.00000,32.88125,69.5500,263.0000
3,5.0,25.951660,7.862611,18.7500,19.25830,23.00000,34.3750,34.3750
4,4.0,84.968750,118.731099,21.0750,26.19375,27.90000,86.6750,263.0000
5,5.0,32.550000,4.101134,29.1250,31.27500,31.27500,31.3875,39.6875
6,1.0,46.900000,NaN,46.9000,46.90000,46.90000,46.9000,46.9000

In [6]:
df.groupby('Pclass')['Fare'].describe()

        count       mean        std  min       25%      50%   75%       max
Pclass
1       216.0  84.154687  78.380373  0.0  30.92395  60.2875  93.5  512.3292
2       184.0  20.662183  13.417399  0.0  13.00000  14.2500  26.0   73.5000
3       491.0  13.675550  11.778142  0.0   7.75000   8.0500  15.5   69.5500

In [7]:
df.groupby('Sex')['Survived'].describe()

        count      mean       std  min  25%  50%  75%  max
Sex
female  314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male    577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [8]:
df.Cabin

0              NaN
1              C85
2              NaN
3             C123
4              NaN
5              NaN
6              E46
7              NaN
8              NaN
9              NaN
10              G6
11            C103
12             NaN
13             NaN
14             NaN
15             NaN
16             NaN
17             NaN
18             NaN
19             NaN
20             NaN
21             D56
22             NaN
23              A6
24             NaN
25             NaN
26             NaN
27     C23 C25 C27
28             NaN
29             NaN
          ...
861            NaN
862            D17
863            NaN
864            NaN
865            NaN
866            NaN
867            A24
868            NaN
869            NaN
870            NaN
871            D35
872    B51 B53 B55
873            NaN
874            NaN
875            NaN
876            NaN
877            NaN
878            NaN
879            C50
880            NaN
881            NaN
882            NaN
883            NaN
884            NaN
885            NaN
886            NaN
887            B42
888            NaN
889           C148
890            NaN
Name: Cabin, Length: 891, dtype: object

In [9]:
df.groupby('Embarked')['Survived'].sum()

Embarked
C     93
Q     30
S    217
Name: Survived, dtype: int64

In [10]:
df.groupby('Embarked')['Survived'].describe()

          count      mean       std  min  25%  50%  75%  max
Embarked
C         168.0  0.553571  0.498608  0.0  0.0  1.0  1.0  1.0
Q          77.0  0.389610  0.490860  0.0  0.0  0.0  1.0  1.0
S         644.0  0.336957  0.473037  0.0  0.0  0.0  1.0  1.0

In [11]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [12]:
pd.crosstab(df.Survived, df.Sex)

Sex       female  male
Survived
0             81   468
1            233   109

In [13]:
pd.crosstab(df.Pclass, df.Survived)

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [14]:
pd.crosstab(df['Embarked'], df['Survived'])

Survived    0    1
Embarked
C          75   93
Q          47   30
S         427  217